const generateComment = () => (
  {
    id: 42,
    author: 'Ilya O Reilly',
    comment: 'a film that changed my life, a true masterpiece, post-credit scene was just amazing omg.',
    date: '2019-05-11T16:12:32.554Z',
    emotion: 'smile'
  });

const generateCommentDust = () => (
  [
    {
      id: 21,
      author: 'Николс Чирк',
      comment: 'Тяжело смотреть фильм , 80 процентов действие в темноте , глаза устают всматриваться в картинку',
      date: '2019-05-12T16:12:32.554Z',
      emotion: 'sleeping'
    },
    {
      id: 22,
      author: 'Жора Бурятов',
      comment: 'Этот фильм нужно каждый вечер смотреть каждому кто искренне считает, что: «Кто сильнее тот и прав» это истина.) ',
      date: '2019-05-12T16:12:32.554Z',
      emotion: 'smile'
    },
    {
      id: 23,
      author: 'Денис Борисов',
      comment: 'Отличный фильм, прекрасные актёры!!!!!',
      date: '2019-05-13T16:12:32.554Z',
      emotion: 'smile'
    },
    {
      id: 24,
      author: 'Наталья Юдакова',
      comment: 'Книгу я читала, но фильм с замечательными актерами буду смотреть в первый раз! Спасибо большое, что выложили!',
      date: '2019-05-14T16:12:32.554Z',
      emotion: 'puke'
    },
    {
      id: 31,
      author: 'Жанна Мамедова',
      comment: 'Книгу читал, и на мой взгляд, лучшая экранизация этого романа. Прекрасно воссоздана атмосфера жестокого мира Волка Ларсена, которого великолепно сыграл Лауцявичус',
      date: '2019-05-12T16:12:32.554Z',
      emotion: 'smile'
    },
    {
      id: 32,
      author: 'Александр Гребнев',
      comment: 'Смотрел в молодости, фильм оставил глубокое впечатление. Это серьёзный фильм, кто не готов, лучше не смотреть',
      date: '2019-05-15T16:12:32.554Z',
      emotion: 'smile'
    },
    {
      id: 33,
      author: 'Елена Суслова',
      comment: 'Фильм о том что в каждом человеке есть звериное начало и задача общества держать человеческое нутро в рамках выработанной морали, необходимых для выживания и очеловечевания.',
      date: '2019-05-15T16:12:32.554Z',
      emotion: 'puke'
    },
    {
      id: 25,
      author: 'Евгений Койрах',
      comment: 'Последний вздох советского кинематографа: этот мини-сериал и "Десять негритят". Оба фильма великолепны. Волк Ларсен идеален - точь-в-точь как в книге.',
      date: '2019-05-16T16:12:32.554Z',
      emotion: 'smile'
    },
  ]);

export {generateComment, generateCommentDust};
